{
  "name": "The following is a transcript of a conversation between the two famous neuroscientists Dr. Buzsaki and Dr. Marder. Dr. Buzsaki's primary interests is 'neural syntax', i.e., how segmentation of neural information is organized by the numerous brain rhythms to support cognitive functions. Dr. Marder studies the dynamics of small neuronal networks, and her work was instrumental in demonstrating that neuronal circuits are not 'hard-wired' but can be reconfigured by neuromodulatory neurons and substances to produce a variety of outputs. The two are having a public academic panel discussion about the function of the higher-order-cortex.\n-BEGIN TRANSCRIPT-\n",
  "children": [
    {
      "name": "Dr. B: 'What do you think is the primary purpose of the association areas in the mouse cortex?'",
      "children": [
        {
          "name": "Dr. M: There are few neurons that are identified as to their roles in a particular animal, and the neurons that are identified that way are quite important as well as the other cells.'",
          "children": [
            {
              "name": "Dr. B:'Now, I am trying to imagine that, for example, in a human, some neurons were identified that are specifically involved in visual perception, some in spatial navigation, others in language processing, and so on and so on. The higher order association areas would be those neurons that are involved in, say, language processing.'",
              "children": [
                {
                  "name": "Dr. M:'Then we could study their role, how they interact with each other under physiological conditions, how their networks interact with each other in the waking brain, how they interact in sleep, how their activity patterns are organized when they are driven by different brain processes. For example, if you take a short part of the mammalian cortex, it consists of a very well tuned system of local circuit connectivity with each neuron having very specific, specific patterns that contribute to the brain. The higher order areas can provide another layer of wiring patterns that contribute to neural syntax, which is a set of patterns that allow the higher order areas to communicate with each other.'",
                  "children": [
                    {
                      "name": "Dr. B:'Does this make it possible to define the primary function of the higher order areas? You don't think this is a plausible approach just by studying the behavior of some neurons. Are there any other promising methods or new approaches to be taken to answer the question about the primary function of these areas? Is there any brain region where it may not be possible to reach a reasonable conclusion about its primary function if one examines its neurons? I mean, this is a basic question that every single system of the brain has to answer: what are the functions are of that system? Is there any region that can't be, for example, conclusively answered by observing neurons? Is there any place that could be as mysterious as the hippocampus?'"
                    }
                  ]
                }
              ]
            },
            {
              "name": "Dr. B:'Would you agree that it is important for you to know why and that is why you would like to pursue these questions in the context of the whole brain?'",
              "children": [
                {
                  "name": "Dr. M:'Yes, absolutely.'"
                }
              ]
            },
            {
              "name": "Dr. B:'Well, we need to identify the exact neuronal types that give rise to specific functions in the brain. Some neurons may only appear in one particular part of the cortex - perhaps a particular layer or layer region depending on the function.'",
              "children": [
                {
                  "name": "Dr. M:'Yes.'",
                  "children": [
                    {
                      "name": "Dr. B:'And other neurons may be scattered in different layers or regions. Some may be scattered in multiple layers and regions, and many other subregions may have similar and distinct functions.'"
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Dr. M:'Oh, the association areas are mainly for motor pattern initiation and tuning, if you really want to put it that way, I guess, and, the big thing is the way that these cells can synchronize to each other, and it's pretty fundamental to this notion, because, for me, the association cells have been a big focus, because you know these cells form a unit that can be controlled together. So, the same process that is used for control of an individual neuron could be used for controlling a network—not just by sending an inhibitory presynaptic potential but to produce something that is either excitatory or inhibitory. And that's what we want to be doing is developing mechanisms like that to allow control of neural circuit activity to be done.'",
          "children": [
            {
              "name": "Dr. B:'What's your take on the role of higher-order cortex? In the mammalian cortex, we have eight layers, which can be thought of as cortex. What makes me think of cortical neurons that way? The top two layers are dedicated to input and output. The middle layer is dedicated to a range of processes for a wide range that has a place in every part of the cortex. There is a lower layer of cortex and the bottom layer is the higher-order cortex.'",
              "children": [
                {
                  "name": "Dr. M:'Yeah.'",
                  "children": [
                    {
                      "name": "Dr. B:-that is the layer where the neurons that have a real place, either on the body, or in the nervous system. Where do you think the neurons that are called cortical neurons go to, and are called, are there neurons? What happens to them? What are they for?'",
                      "children": [
                        {
                          "name": "Dr. M:'That depends on what region of the nervous system you're talking about.'",
                          "children": [
                            {
                              "name": "Dr. M: yeah, maybe they're used during all periods of the lifespan—for the maintenance of the motor patterns or other stuff. There are certainly neuron types that use to serve the needs of different areas of the nervous system and then get repurposed, because there are very different neurons that are used for different functions, including different levels.'"
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "Dr. B:'So what do you mean by circuit? As in neurons connected by their axons and the same synapses, but the circuits that we're thinking about to be able to control are the cortical circuits that are connected with each other by various neurotransmitters. Are they not interconnected and just have some dedicated connectivity, which you'd be interested in developing ways to control?'",
              "children": [
                {
                  "name": "Dr. M:'Yes, I mean, sure some connectivity. I mean, like a group of cells that would do a particular thing, you know, and if you can develop a mechanism to do that with a group of cells, this is interesting and it would be really interesting to watch this type of thing work.'",
                  "children": [
                    {
                      "name": "Dr. B:'To have this circuit controlled, and in principle, the entire brain can be controlled, as it was with some people thought. And, and then the question is in principle, what could be done with this circuit? What sort of potential cognitive functions could these neurons be used for that have, and what sort of mechanisms should exist to control these neurons? For instance, I've seen on this blog, where someone talked about using a similar mechanism to regulate certain types of memory. It's a very interesting question. I mean, how would you do that?'",
                      "children": [
                        {
                          "name": "Dr. M:'It's really, you know, we're just going to end up having some sort of set of neurons that are in constant, you know, that have a constant set of voltage thresholds, that can be regulated somehow by the synaptic input that they've, that they receive, because these really neurons, and neurons that are just constantly, like neurons that never stop firing, you know, if you have a set of neurons that just constantly fire, or if you had neurons that have a constant number of spikes per burst, you know, those neurons fire a lot continuously, and then neurons that might be tonically firing.'"
                        }
                      ]
                    },
                    {
                      "name": "Dr. B:'Could you say what that function would be? What do you see in the hippocampus that should be controlled? I'm not talking about that area in particular, but where these neurons are wired to each other and could be responsive to some manipulation. Does it matter what neuronal group the circuit targets, the hippocampus proper, or the septal part that would be targeted, or for example, what do you see for the neocortex or other areas in general?'"
                    }
                  ]
                }
              ]
            },
            {
              "name": "Dr. B:'That's what I'm asking at all, at all. So that the activity will move in the direction that we want to move it, and that we want to generate something that is useful for our brain.  Right. And so as soon as you see mechanism, you get a solution to problem X, then it becomes the right direction to research, in which you go toward solving the problems, of X, to do those three things, to control the activity of the network, send messages to the neocortex, and then do something in the brain that's beneficial for it, a useful activity or modification for it, but in a way that, that's where we are. And that's where are the mechanisms that are currently used for control of neural circuits. And we want to move that forward, or enhance it to allow control of the activity of the neural circuits at will.  Okay. And then I'll move to ask you a few questions from the audience.  Okay.'"
            }
          ]
        },
        {
          "name": "Dr. M:'I think it has to be with sensory integration so that you can have all kinds of sensory inputs that you want to use to determine, say, movement in the environment. It's not for information processing, as it is in the cortex'.'",
          "children": [
            {
              "name": "Dr. B:'I understand.'",
              "children": [
                {
                  "name": "Dr. M: 'Yes'.'"
                }
              ]
            },
            {
              "name": "Dr. B:'Do you see it differently? You're a realist, right? You think that once we have the answer, we can work our way up? What is, what is the primary role of the association areas? What is its function?'"
            },
            {
              "name": "Dr. B:'When I was in school, I had to learn about many languages. I was interested mostly in English and Mathematics. In high school, most of my time was spent with friends. At the end of my high school career, I was good friends with a couple of girls, and this was how I entered a path to science. They were the first women I ever met who were able to talk about things like mathematics, physics, chemistry, and anatomy freely, and in high school, I wondered what they did when they grew up. I decided to become a scientist at the University of Lbeck in Lbeck, Germany.'"
            },
            {
              "name": "Dr. B:'Right. Well, then it may be that, for instance, the auditory cortex is there primarily as a sensor that can determine whether you fall off your ledge under the water, and motor and limbic regions are there to calculate what kind of movement you do in those movements to rescue yourself. I mean, the limbic system has long associations with things like emotional states and decision-making and all those things, but it does not have a function within the limbic areas, as I would call it, but that's because the whole point of the limbic system is whether or not an effect should be initiated.'",
              "children": [
                {
                  "name": "Dr. M:'Right. Well I think the fact that you have that network that's independent of these things, I don't necessarily think there'll be one primary function or, you know, the whole point is, in fact, the limbic network has all kinds of functions. The auditory sensory network has all kinds. The sensory integration network, the auditory network has all kinds, because you know, the retina and the pylorus, all these muscles have their own individual functions that are not necessarily for moving the body, because those muscles are used by the muscles, and all the muscles that move in the body. So, you know, I think the, if you wanna have a network of many different regions of different neurons that are network in themselves and can generate activity on their own and be integrated with the other regions of the network, I mean, it's possible that that network can generate its own actions. That can happen with the sensory regions.'"
                }
              ]
            },
            {
              "name": "Dr. B:'Is it not for information processing? Should we forget that? Are you suggesting... Do you think the association area is not working in the standard way that it is thought about in the mind? It's doing a job of integrating information... It's doing a big job of grouping neural information into useful chunks so that it can be effectively used in any brain region that it would use... So it's doing a big service. The brain is able to integrate in a very reliable way and it's working pretty well. I don't want to ignore how it's working, but I need to make sure to, uh, highlight how our brain is working. I'm saying all this, uh, in the context of, uh, of how the brain works in the cortex. I don't know if you know this, but you know, that was an interesting paper that came out recently called the brain from inside out, which takes stock of all past progress and all future challenges.'",
              "children": [
                {
                  "name": "Dr. M:'Yeah, no, uh, which takes stock to the past, so we looked back at earlier studies, so the idea of segmentation was first thought about 70 years ago when some, oh, uh, scientists at Harvard thought, uh, that, uh, brain regions were not uniform neurons, but, uh, that's certainly true. The neurons are distinct. They are distinct because they have their own electrical properties, they're distinct in many biochemical properties but, uh, they also send electrical, uh, electrical information to each other. So we're back, so to the past, but it was clear early on that neurons could contribute substantially to many different neuronal circuits so that's what the association area is for, for, uh, to help you with electrical transmission. Okay?'",
                  "children": [
                    {
                      "name": "Dr. B:'So what's your answer and why would you make a different choice? What is your answer? Why is the association area not working in the way that it is currently thought about? Because that's a big, uh, question, and I want to know if you have a particular answer. And there are, uh, two ways to look at it. One is a, so there's, uh, the first, uh, way of looking at the question is that, uh, if you are looking at the history of brain rhythms, then one can only feel sorry for the lack of a good answer. The rhythm has no meaning to you without a functional interpretation. So this, for instance, uh, theta oscillation in the hippocampus, this is a nice rhythm and I want to make a good use of it. So that's one interpretation.'"
                    }
                  ]
                }
              ]
            },
            {
              "name": "Dr. B:'How would you go about understanding that? I mean, how would you approach it?'",
              "children": [
                {
                  "name": "Dr. M: 'So, the primary function is integration. You have all kinds of sensors and your choice to use them is a particular kind that would produce a particular sequence of actions, which is your response to some kind of a sensory input. In case of some error, to be aware of the fact that something is erroneous and correct it. As they say the primary function of cortex is to integrate.'",
                  "children": [
                    {
                      "name": "Dr. B:'And then what would such integration include? I mean, what would a mouse integrate? How could you conceptualize something that would match that idea?'"
                    },
                    {
                      "name": "Dr. B:'Would you call, say, the primary function to be integrate and process or would you call it more of an integrating and processing role?'",
                      "children": [
                        {
                          "name": "Dr. M:'No, I would think that is processing. There would have to be integration first and processing. The primary function is to integrate and then you process, but you have to integrate first in order to do anything different.'"
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "Dr. B:'So, I think what's in the main stream, the primary stream of association areas in the cortex is a motor program. Or maybe the best way to say it is that the streams of information are about action rather than processing. You want to make movement. You try to find the connections that can move you. There are, in fact, very few connections that can have high-level effect but they are hard on the backbone; they are low frequency connections. Of course, there's another class of connections, as there are only a few that can also change your mind, as there are few connections that can induce a change in your mind but it is weak. We have a thousand things that are low frequency in the brain, but they have high influence. What we call it 'executive function' which is the ability to use all these signals to move or manipulate the brain according to the immediate needs.'"
            },
            {
              "name": "Dr. B:'Ok, so they are sensory, but they're not sensory, but rather, they provide computational support for incoming signals based on prior knowledge and action trajectories. I could put a camera in. And then you have inputs, and the camera, the brain or you can call it an output system. And then you can put a camera in too to monitor, and use the camera as a proxy for the cortex. This is a different way of trying to figure out how the cortex functions through the eyes of action.'",
              "children": [
                {
                  "name": "Dr. M: 'This is an entirely different way of thinking about how the cortex function though the eyes of action. In fact, you can go further, and say the primary goal of the brain is not to sense the world, but to act in it. And this means the primary purpose is to do something else'.'"
                }
              ]
            },
            {
              "name": "Dr. B:'What do you think about the motor cortex? It has a lot of neurons devoted to movement.'",
              "children": [
                {
                  "name": "Dr. M: 'It is still an action system. There are two layers and a bunch of cells. That is, the cortex is still a system that is very active, but it's mainly in an action-based manner..'"
                }
              ]
            },
            {
              "name": "Dr. B:'I see this differently. But if we were to define the association areas, what would it be?'",
              "children": [
                {
                  "name": "Dr. M:I agree with you from a functional perspective, but that really is a difficult question to answer objectively. But from a circuit perspective, it would be the neurons with axon collaterals around those neurons with axon collateral that connect those neurons to the sensory, auditory, or other areas of the cortex. So there's really a specific definition, and the key thing would be that axon collaterality in the same brain structure as that neurons, which would have axon collaterally that connect those neurons in that brain structure. What do you think is a functional role?'"
                }
              ]
            }
          ]
        },
        {
          "name": "Dr. M:'Well I think they're very much required for the association areas, for the coordination between the motor neurons. Because without them, if you don't have one with one motor neuron, if you have some of the other ones, it makes it impossible to coordinate with one, or sometimes if it is a larger group it makes coordinating with them very difficult.'",
          "children": [
            {
              "name": "Dr. B:'Is there anything you're interested in?'",
              "children": [
                {
                  "name": "Dr. M:'Really!'",
                  "children": [
                    {
                      "name": "Dr. M: Well, I don't just think about what I talk about.'",
                      "children": [
                        {
                          "name": "Dr. B:'I'm sure there are a lot of things that come to your thinking when you are looking at information. Can you tell us something that you are thinking about right now, and might be able to help us understand? Do you have a piece of research or research program at the moment that you are looking at? Something that you're working on, and it's probably not the most ambitious, but it seems interesting to me, maybe even critical to understand something, and your goal is to understand something. If you can point to something that you're really working on, maybe even a small research program, what are your first steps in that, to start understanding something? It would be amazing if there could be some understanding in the next 12 months that we can have in the next six months that would tell us where we are going here.'"
                        }
                      ]
                    },
                    {
                      "name": "Dr. B:'Why?'"
                    }
                  ]
                },
                {
                  "name": "Dr. M:'No I'm not, I study neural signaling. So, I'm interested primarily in neural signaling, I think.'",
                  "children": [
                    {
                      "name": "Dr. B:\"The only neurons that have a small number of connections are the Lateral Pyloric and Dorsal Longitudinal Pyloric neurons, because they have a small number connections. So for me, what the primary purpose of these, is to coordinate the actions of a large group of neurons that fire in relatively small groups of neurons. It's not particularly to build a little microcircuit for each individual user, because you have a long interneuron firing. That is the function that I think is the primary function of the connectivity.'",
                      "children": [
                        {
                          "name": "Dr. M: 'How many connections in those neurons?'",
                          "children": [
                            {
                              "name": "Dr. B:'It's hard to give a number, but from various reviews it seems that they're at least hundreds and thousands, and that's a large group of connections that can make up a circuit.'",
                              "children": [
                                {
                                  "name": "Dr, M: 'Yes, one of the most striking circuit connections in the brain is in the hippocampus. Where Lateral Pylrical neurons get their inputs from local cortical neurons, and this network can be conceived of as a three-layer, superficial, middle layer, and a third layer and layer connecting layer called the dentate gyrus. These multiple connections require a lot of synapses, in which there are in the hippocampus a couple of trillion synapses, which gives you a tremendous variety of combinations to allow for the large dynamic potential of that network.'"
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "Dr. B:'Why is that? Is there a scientific reason?'",
              "children": [
                {
                  "name": "Dr. M:'I think it serves as sort of a boundary. To separate, or to separate the group from each other.'",
                  "children": [
                    {
                      "name": "Dr. B:'Is that a necessary requirement? That is it is there to separate the group, that is it is there, in isolation.'",
                      "children": [
                        {
                          "name": "Dr. M: 'Well, how else could it be achieved? One way is by having a group with a single shared goal, but that works best when some sort of a communication is also made among them, and the communication is only really made when information comes in both directions, or when information is sent between them.'"
                        },
                        {
                          "name": "Dr. M:'It serves as an interface.' In many cases between groups, and some cells do separate from each other. They're not exactly in groups, but still if they're not in groups, if they don't have one of each of their own neurons, they depend on this, these coordination that takes place around them.' 'But the definition of a group?' In many cases as well, there is an association around the periphery between groups, or sometimes there is no apparent association between groups. So it serves as an interface around groups of neurons, and the definition of a network is usually different, usually from the other networks because if they're all very close to the center, then by definition, you don't need the periphery or you can't do that because that's a group. So I mean, they serve a bunch of other functions that aren't particularly related to these other functions.'"
                        }
                      ]
                    },
                    {
                      "name": "Dr. B:'So they're like a wall.'",
                      "children": [
                        {
                          "name": "Dr. M:'They sort of, they have to separate the two groups because sometimes, you know, if things happen and different neurons have to fire together for, for good reason and you know, they want to stop, you know, there could be multiple of them, and they always have to be well separated, yeah, and it's easier, just, you know, in all sorts of other ways it's easier to use the space or to, you know to separate it.'"
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "Dr. B:'Can you give some examples or provide some examples in which that could happen, that is to coordinate with the other ones, in a larger group that doesn't include a specific motor neuron?'"
            }
          ]
        },
        {
          "name": "Dr. M:'Well, the primary purpose of a functional anatomy study is to provide insight into an animal's behavior and physiology. And in the nervous system, neurons and other tissue elements are tightly integrated into many different behaviors and therefore you want to study the whole brain.'",
          "children": [
            {
              "name": "Dr. B:'So what is a fundamental difference between your approach and mine?'",
              "children": [
                {
                  "name": "Dr. M: 'You know it's like, we both have different visions and different toolsets but I think we just approach the problems in different ways.'"
                },
                {
                  "name": "Dr. M:'I study the brain's structure, its circuits, at the level of circuit behavior in the brain. Your approach is really about how the brain works, how a network behaves when you perturb a network. So, if you use a hammer or a scalpel, a knife or a scalpel to cut a brain section out, there are all kinds of circuits that will come out. It will be one circuit connected to the next circuit and different circuits of neurons that will start coming out so you want to study how circuits behave as you gradually remove neurons that are doing different kinds of computations. You understand, and this I think is the fundamental problem with your approach is that if there are 50 different structures there to study, this becomes a very difficult problem to study how they all contribute to behavior.'",
                  "children": [
                    {
                      "name": "Dr. M: So, I am an anatomist, it's the first thing you look at. It is a way of knowing how a brain is organized into functional circuits.'"
                    }
                  ]
                }
              ]
            },
            {
              "name": "Dr. B:'And what are the behaviors and physiological patterns that the association areas are involved in?'",
              "children": [
                {
                  "name": "Dr. M: Well, these are the kinds of things that happen to other cells. One example is the timing, synchrony of neurons is critical for a variety of brain functions. The other example is the temporal relationship between activity of neurons, and there are dozens, if not hundreds of these types of behaviors in the hippocampus as well as in a variety of cortical areas. And as all of these are brain states associated with oscillations, as I stated earlier they represent a big target of research. We really are in a good position to examine different behaviors and examine how are they supported by brain mechanisms.'"
                }
              ]
            }
          ]
        },
        {
          "name": "Dr. M:'Well, I think it depends on the preparation. Some mice have one or two small areas -you know, I think the largest one is, like, a little island and then it's smaller than that island in both direction. So that's it. But if you use, you know, if you create these mice with the single-cell-type neuron, then you are essentially generating these network models with a one kind of neuron. And it's really hard to do that, you know because then you have all the complexities of the networks that you want from them, and you also have your single-cell-neuron properties. So in some cases it's simpler to have one or two, you know, maybe three neuron types. So that's the case that I know is, like, simpler in that sense.'",
          "children": [
            {
              "name": "Dr. B:'So, you know, what are the advantages of that? And what are the disadvantages of that?'",
              "children": [
                {
                  "name": "Dr. M:'What do you consider as an advantage? I mean I think like how can we do this using smaller numbers of cells, like, you know, as you said initially you had two neurons and the other four were peripheral cells, so how can we build neurons from cells that are different? Like how are we going to do this by starting with five cells and then growing it?'",
                  "children": [
                    {
                      "name": "Dr. B:] 'You know, that's the problem. Can you start with five neurons and grow it? How are we going to grow an army of neurons?'",
                      "children": [
                        {
                          "name": "Dr. M: 'But we still have this problem of how does the network grow?'",
                          "children": [
                            {
                              "name": "Dr. B:'Well, and what is growth? You know, what is the growth? So you may say that it's growth in terms of network size. You may say that it is expansion in the number of cells that a single mouse can have and so forth. There are many other ways, just like you said the number of branches and so the number of things goes on forever. What I'm asking you is what's the strategy? What is your strategy for how this network is going to grow and expand?'"
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "Dr. B:'Is there a goal? Do we know what we want in the future? Or is it just a goal in addition to the science that we are working on?'",
              "children": [
                {
                  "name": "Dr. M:'I think that is one of the big issues. It's clear in my mind that when you want to do a cell type experiment, you want to understand something, you know. I have three cell types in my mind for example. So, it's clear. And I think in general, yeah, I think we want to understand how synaptic strengths change or some other properties that may occur in a cell and at how a cell is put together. I think that is one example of when I thought it was clear that I had wanted to understand the mechanisms of synapse reversal potentials and the fact that you can change or change a synaptic connection of a synapse or a synaptic conductance in a neuron to a different direction. Yeah, so that's one thing that really, it wasn't clear. That is, at that point in time, did you know, this wasn't done. So that was the next direction.'",
                  "children": [
                    {
                      "name": "Dr. B:'So, how is it then clear how you would actually find what you would be looking for after several years? Because the longer this goes on, the larger is the problem of the next big thing that we have to do in the brain. It doesn't seem to have an end.'"
                    }
                  ]
                }
              ]
            },
            {
              "name": "Dr. B:'Is there a higher order cortex in humans, although there still remains a large degree of controversy.'"
            }
          ]
        },
        {
          "name": "Dr. M:'Well, I think—and this is, this is just my personal perspective, as a neuroscientist—I think that is the place where you learn all about your circuit function. So many times in biology it's the case where we know you have this part of the cell, and we know that it is important for the function, but we don't necessarily know exactly how it is used by the cell. A large example is with synaptic inhibitory activity in animals and humans. The synaptic activity of inhibitory synapses is important for muscle contraction or muscle contraction, but not for muscle relaxation. It can also provide the inhibition to the gastric mill rhythm, which is essential for digestion. Right? So the nervous system uses a variety of electrical synapses to maintain function. It uses it to keep the rhythms alive, it uses it to modulate or change the properties of neurons, and that's why it really is so important.'",
          "children": [
            {
              "name": "Dr. B:'A good example of how important this is is the alpha rhythm. This has been recently studied in depth in an incredible way, that it's essential for normal cognition in humans as well as in other animals. It is the largest oscillation in the mammalian brain, and it involves a consortium of many, many, many neurons. You have to work together, and you have to work in time, which is perhaps a fundamental thing that we still haven't solved. Of course, there would be a lot of reasons to solve if the neural syntax would be known. And the way that it would be solved is if we would have a good idea of what information the neurons are communicating in their spikes and how they are being transmitted. Right? That would allow us to do computer-assisted searches and find out in which direction the neurons are firing, and this would let the brain work out what is required. This is the problem that we have to solve.'",
              "children": [
                {
                  "name": "Dr. M:'Right. So I have always thought that all neurons are sending information. They're not just firing, you know, they're firing information out to other cells. So, you know, maybe you can fire a tonne of information, but all of the neurons need to be sending information, and the information has to be processed in a way that it can be utilized. There are, obviously, a couple of important neurons that don't want to fire and are silent, but are important, and there are some that just fire continuously, and they are less important, but there may be some other combination. But—of course, there is always the important problem, and that is the problem of how does this—you know, how does this integration of many neurons really happen, and how does it occur, and it's probably not the same in every brain, and it's also probably the consequence of evolution. How does evolution produce the circuit diversity we see across brain circuits throughout evolution?'",
                  "children": [
                    {
                      "name": "Dr. B:'Well, and the problem that we, that we also have to solve is how is this, how is this integration occurring? And, um, it could be a coincidence of timing or, or it could be synchrony, which is the mechanism for neuronal synchronization. The way that is it is happening in the hippocampus, which is a complex, complex system, but it's a synchronized population of neurons. And when you are looking at many neuronal assemblies in this small population, they are sending a different set of messages that the other neurons are receiving. And there are these very critical mechanisms that allow those messages to be processed. It's probably similar in the cerebral cortex. And the messages are also being processed. All these issues must be dealt with when we are thinking about how to understand the function of the brain as it is now. And in addition, we have to find a way to understand what it is because the brain is a complex system.'"
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Dr. M:'Well, as far as I understand it they're essential for the mouse to be able to hear its mates and smell others of its kind. And also to hear high-frequency sounds. So to me it seemed like a really big deal that for  C. borealis  to behave properly it had to be able to smell others of its own kind. So far, it seems to me that in general, although, as far as mice, cats and monkeys are concerned, they can behave properly as far as social interactions but their nervous systems still haven't gotten to the point where they can behave properly by responding to their own rhythms.'",
          "children": [
            {
              "name": "Dr. B:'The same applies to other parts of the brain such as the visual cortex, which is the main primary sensory organ. So it looks like the primary purpose of this part of the mouse cerebral cortex is to process and transmit the external world to its owner's brain. But what do you think is so special about these parts?'"
            },
            {
              "name": "Dr. B:'What do you think, though, in the case of mice, how the brain can build an independent system from the existing brain networks? Do you think it starts from the very beginning and then makes a long run? How do you think we build in the brain a capacity to use its existing connectivity in order to do more complicated stuff?' (Dr. M does acknowledge in the video description of the TED conversation that, even in the case of the hippocampus-entorhinal loop, where there are hundreds and thousands of oscillations in the mouse, very often these oscillations were discovered subsequently with research that didn't start out with a hypothesis about the function of these oscillations. But she emphasizes it's not that there aren't enough oscillations. What I'm asking is how they can make use of and exploit not only these oscillations but these connections. How do you do new things with the existing?'"
            }
          ]
        },
        {
          "name": "Dr. M:'They provide a bridge between sensory and motor circuits.'",
          "children": [
            {
              "name": "Dr. B:'Exactly?'",
              "children": [
                {
                  "name": "Dr. M:'So, you take, for example, this, this, this network, which is the primary sensory neuron, the pacemaker of the brain, the core of all the sensory neurons in a small network. When a stimulus comes in through a single sensory or motor neuron, it has nowhere to go, because it has sensory circuits and motor circuits. If you take this network itself, if a stimulus comes through a neuropil, a small aperture that's in the head between the fore- and the central-fornixes, through the pyloric dilator nerve that goes through the lateral ventrical, you can open it up and you can look into the posterior ventrial nerve, which opens up to the association areas where the small motor networks and the small sensory networks are actually in direct contact with each other. The association area is filled with nerves that branch into tiny processes and make direct contact with neurons in the individual networks.'",
                  "children": [
                    {
                      "name": "Dr. B:'So what is the function of these processes?'"
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Dr. M:'My thesis is the primary purpose is to act as a filter, a receptor. That is to receive small, synaptic inputs that are then amplified to action potentials that can have a tonic action potentials. However, the main function is to filter and then amplify incoming synaptic inputs. To respond to many, many small inputs, small synaptic inputs. We have several synapses that go through the filtering apparatus. For example, the glutamatergic synapse on the pyloric pacemaker (PG) neurons, and the synapse of the anterior pyloric neuron from LP to the PG and to PY. This synapse is small, is only approximately a micrometer and is the first one to be transmitted up the dendrites of the LP neuron and, then, to be relayed to the anterior ganglia. Therefore, it is part of the filtering mechanism.'",
          "children": [
            {
              "name": "Dr. B:'Is the input and output separation so that the glutamater-gic inputs that come in at other neurons, such as the cholinergic and GABAergic inputs, that come in through the associational areas are separated in the upstream parts and then amplified at the downstream parts?'",
              "children": [
                {
                  "name": "Dr. M:'The upstream part is amplifying synaptic inputs, which then get further processed at the downstream part. Therefore, the input and output is separated and thus you get, for instance, the segregation of inputs coming from different neurotransmitters.'",
                  "children": [
                    {
                      "name": "Dr. M: 'And then if one of the synapses is inhibited, the other synapses will automatically get activated, because the inhibitory synaptic current is removed from the cell and then the cell will get a depolarized membrane potential and, because of all of these synapses going up to and filtering, amplifying, the depolarized membrane voltage it will be released. So, this is part of the synaptic transmission mechanism. So, the input and the output of a biological synapse are segregated; the input is further processed at the peripheral and the output is processed at the central level.'"
                    },
                    {
                      "name": "Dr. B:'So in your model, this division is provided by a few special cells that sort of serve as a divisional gate between the associational areas and the downstream cortical areas, and, therefore, the inputs are processed, amplified and sent on their way to the output layer without reaching the associational areas.'",
                      "children": [
                        {
                          "name": "Dr. M: 'One can think this is an analogy to the filtering mechanism by the GABAergic neurons, the inhibitory interneurons. These are special interneuronal targets and that are specialized for their downstream partner neurons. In the visual system we have a few special inhibitory targets that are specialized for the visual transmission of certain input information, and we can call them as filtering or channeling mechanisms, that's all that they are. What does the cortex need to accomplish? Inhibition does not produce an output, but to prevent the transmission of information.'"
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Dr. M:'The associative cortex, as it's been called, is used to deal with spatial and other cognitive considerations.'",
          "children": [
            {
              "name": "Dr. B:'Yes. There are numerous tasks that have to be considered that are related to navigation, and those are handled by other, very fundamental mechanisms in the hippocampus. Now, the things that the associative cortex is used for are what have been called, for instance, context-dependent memory. What is context? The context is the brain's ability to manipulate the hippocampus to extract different details of a situation depending upon where it occurs. For instance, if a mouse is in the home cage during the hours of darkness, when there are many sensory systems being active, and if it is only during the hours of light, when the hippocampus is active in many ways, then it would be perfectly logical also to say that the hippocampus deals with local decisions.'",
              "children": [
                {
                  "name": "Dr. M:'Absolutely!'"
                },
                {
                  "name": "Dr. M:'It's easy to misunderstand what this cortex is for. Like, I see the term the cortex in many publications, and I think it's just the cortex, the whole neocortex is called the cortex, I think my problem is, because when we started making that connection between the cortex and the synaptic connectivity and the microcircuits, the term cortex seemed to come up first as a reference for everything in the system, but it became this kind of shorthand. So when we started seeing these features of the cortex, its role as the main processor of spatial processing, and its role in extracting sensory modalities, and its role as integrating and coordinating the results of those kinds of mechanisms was missed'.'"
                }
              ]
            },
            {
              "name": "Dr. B:'Let me remind both you that I was the one to ask that question. What is the primary purpose or goal of the associative cortex? Let me push it over to you, please.'",
              "children": [
                {
                  "name": "Dr. M: 'I'm already pushing it to you.'",
                  "children": [
                    {
                      "name": "Dr. M:- 'I'm going to answer this from my perspective, but I don't mind if, and hopefully, after you respond, I'll get it from a little bit more of a bird's eye view from you, from your perspective.'"
                    }
                  ]
                }
              ]
            },
            {
              "name": "Dr. B:'But the primary function of the mammalian cortex is to generate the various outputs for the sensory inputs, be they vision, taste, hearing, or the reafferentation from action, which is the only way the cortex sends out messages.'",
              "children": [
                {
                  "name": "Dr. M: 'I'm sure it is not as simple as that because if that were the case. There would be only action receptors in the cortex and there would be not have a lot of other sensory systems. So, we have to make decisions. How are we going to analyze a system by simply going with the default mode? My answer is that there's no magic, no solution. What I think is the primary function of all the circuits is to integrate a lot of distributed inputs to create behavioral actions through their outputs. So that's the primary goal of brain circuits.'"
                }
              ]
            }
          ]
        },
        {
          "name": "Dr. M:'What do you think?'",
          "children": [
            {
              "name": "Dr. B:'I think one of the primary function is to regulate synaptic transmission.'",
              "children": [
                {
                  "name": "Dr. M:'So maybe to regulate synaptic transmission in the mouse and the  C. elegans  neuron?'"
                }
              ]
            },
            {
              "name": "Dr. B:'What do we know about these areas?'"
            },
            {
              "name": "Dr. B:'What do you say? What is your answer?'"
            }
          ]
        },
        {
          "name": "Dr. M:'I think they primarily maintain synchronous firing patterns'.'",
          "children": [
            {
              "name": "Dr. M: 'When you think of a network, like a neuron circuit, what are  the 'final goals' of a neuron circuit? What is its purpose?'",
              "children": [
                {
                  "name": "Dr. B:\"Well, I don't know if there are 'final goals', but we want to figure it out.'",
                  "children": [
                    {
                      "name": "Dr. M:'Well, so let me tell you the purpose of our work. For many years we were working on a model of the brain that was based on the properties of the pyloric neurons in the PD (Pyloric Dilator) and LP (Lateral Pyloric) cells of the STG in the pyloric circuit. And we were trying to see if we could get the different circuits of neurons, neurons that are involved in brain processes, like emotion, to come in synchrony with each other. We didn't think that was possible. But we thought that we would be able to understand the brain by doing the measurements, getting single neurons, working with multiple neurons, that you've done so elegantly in your experiments.'"
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Dr. M:'The primary purpose of the cortical association zones is to be a very short-lived local circuit, like a relay station, basically saying OK, there goes an electrical impulse from the axon of the stomatogastric neuron and that circuit is going to be active only for a short time while the synapses at the neuromolecular level are being built up, which depends on the speed of the underlying ionic currents.'",
          "children": [
            {
              "name": "Dr. B:'So what can a neocortical circuit possibly do? What can be the main task of the association zones?'",
              "children": [
                {
                  "name": "Dr. M: 'This is a very important question, in which I have not been able to see a straightforward answer. There are two ways to answer the question, but no, there are multiple ways to answer. There's an easy, very straightforward answer that I can try to give today. So, we will not try to be exhaustive, but I will attempt to keep it simple.'"
                }
              ]
            },
            {
              "name": "Dr. B:'I have a lot of experience with the mouse brain. I would take as an example cortical area 13. It is a very beautiful associational structure, and the wiring patterns of the associational zones are absolutely unique in the brain. It would seem to me that the structure evolved to create an input signal which could not be used for a very long time even if it has the ability to do a quick computation, and in the process it generates activity that is going to be released by inhibition - for example, to say \"OK, so it is worth that I use a system that is unique for the activity of the brain for a very short time. Let me turn it out so it doesn't have to be in use forever.'",
              "children": [
                {
                  "name": "Dr. M: 'Of course that's not quite right. There are other functions also in this system that are not related to the principal function that this very unique circuit performs, but they are important for other operations in the brain.'"
                },
                {
                  "name": "Dr. M:'Why would anybody want a circuit that is active only for a very short term, but has the advantage that you would lose the ability to use the circuit if you made it permanent, or to use to conduct research?'",
                  "children": [
                    {
                      "name": "Dr. M: 'But it could be milliseconds.'"
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Dr. M:'This is where the processing is done, obviously, because that's where there are neurons which are responsible for all of the other processing steps: The calculation of neural network parameters, the regulation of all of the network parameters (particularly of calcium pump expression) is done here. It's not easy to determine the parameters for a neural network to be activated by a particular stimulus and to achieve a particular function. So we have to know how the regulatory process of the cellular level is going to affect the network, so we have to develop this parameter space'.'",
          "children": [
            {
              "name": "Dr. B:'Why don't we call this \"corticocortical associational areas because that would mean it's on a cortical module and we could work this problem from that. Why do we call them the \"association areas?\" What function do they have?'",
              "children": [
                {
                  "name": "Dr. M:'Well, I don't think that the function is so important in a sense that I always think back to trying to understand function as a principle to understand cognition, but that doesn't tell you where the function is going to be: For example, you can say that the role of a network that governs an animal's behavior in the cold is an important network that requires some special properties from neurons and some special properties from synaptic connections.'",
                  "children": [
                    {
                      "name": "Dr. B:'Well, I mean, it's all the same here in the sense that in order to be able to perform a particular kind of computation, they have to understand how the various layers and cortical modules relate to one another as well as to world-level structures. So it would have the same advantages. I suppose that for some time in the past, we thought that the fundamental problem is understanding how the different parts of this cortex relate to one another; we have different areas. In fact, we have multiple areas in the cortex that have a particular name. It's as I know the different name of the different cortical segments, but the reason of their individual name is their function, their special ability in my question: \"What are the primary functions of a network?'"
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Dr. M:'Well, one of the main purposes is to provide feedback. You know it depends on the activity of the central pattern generating neurons.'",
          "children": [
            {
              "name": "Dr. B:'OK.    That should come about very frequently in the cortex anyway. It's easy to generate a bunch of neurons that fire rhythmically in any cortical area - just give them some inhibition. However, what matters for neuronal syntax is what happens when they are inhibited. So if you're able to inhibit these rhythmic patterns, even in a single case, you can generate a completely different function.'"
            }
          ]
        },
        {
          "name": "Dr. M:'When you get a brain that is as complex as ours, one of the first things you notice is, that these cell types are arranged in an anatomical pattern that is different from any other kind of animal that you have seen. So the most naive thing we do when we start thinking about this is we just think that these circuits must have a primary role. For example, this brain here has got a primary role and I'm going to describe you the whole story but it has got a primary function. I mean, what primary functions, we can't tell you the primary function of this brain because we don't know what inputs and feedback that this brain got but we can guess it might be involved in vision, because presumably it got some visual input. You know, so this brain might get sensory input. It might possibly get excitatory and inhibitory input from the orexic neurons or from the pyloric neurons.'",
          "children": [
            {
              "name": "Dr. B:'Well, that's a very good guess, but does the brain have an ability to detect those input sequences?'",
              "children": [
                {
                  "name": "Dr. M:'And then the only difference between us and other animals you saw is that if you take a brain that looks the same and you take all the sensory inputs and you take all of the excitatory and the inhibitory inputs that come into the brain, the neurons fire in a pattern that seems to relate to how the brain is using them. So we found that these neurons that fire with this pattern change over time, during development, during time that the brain changes because the nervous system changes, and in fact, they go through phases where they have more of one kind of oscillator over time and they cycle back and forth. So these rhythms change, they evolve during time the brain is changing, they change over time, and it's only through the recording of these neurons that we are able to decipher the underlying mechanism to how these circuits are regulated.'"
                }
              ]
            }
          ]
        },
        {
          "name": "Dr. M:'Well, of course, they're associated with all kinds of processes in their own right, but, you know, it's just because the connection of the cortex to the motor neuron and sensory and network, and to the periphery, is all mediated through them. So, the function of the association areas seems to be just to provide a platform for all the networks, to sort of hold them all into place, because they all have to connect to each other.'",
          "children": [
            {
              "name": "Dr. B:'Connectivity' – you have said about your work. Connectivity in the network. The purpose of them being associated with the peripheral nervous system, is in line with that. Are they also a platform for electrical coupling?'",
              "children": [
                {
                  "name": "Dr. M:'No, not really. No. I mean, the only way that they'll be electrically coupled is if they're attached to each motor and each sensory, because one of the big differences between the association area neurons and neurons from other processes in the nervous system, is that for the association neurons you can control the electrical strength of the connections. So you can either enhance the electrical strength of one of the connections, or decrease it or break it. Because the electrical coupling comes from electrically active voltage-gated ion channels – or, at least, voltage-gated potassium channels, and it's important also to have another type of ion channel in this association neuron because of the importance of calcium in regulating processes of transcription with histones. So it's important that we have calcium channels, but the calcium channel does not play a role in the activation of the GABA A synaptic transmission.'",
                  "children": [
                    {
                      "name": "Dr. B:'In other words, you have the ability to manipulate them either with drugs or genes – the calcium channel is not active, but if you have another type of channel, then you can manipulate them and, in addition, you can also control the strength of GABA A transmission from other neurons, from the GABAergic neurons of this association area. Those are the possibilities you have. And those are functions that connect the association area to the motor neuron, and sensorimotor system and so on that they're connected to.'",
                      "children": [
                        {
                          "name": "Dr. M: 'What would be a role for the associational areas in enhancing a higher-order function? Like in my dream, or the mind-wipe in my recent dream, where we have access to an ability to erase information in a distributed manner, including synapses and even cells or their synaptic processes in the cortex. How would a particular brain rhythm enhance this ability or the synaptic connections between those two neurons?'  Dr.'"
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Dr. M:'The primary purpose of the associator is to coordinate neural activity among neuron communities that operate for a specific purpose, which might include muscle contraction.'",
          "children": [
            {
              "name": "Dr. B:'What are neurons that have to communicate with each other?'"
            },
            {
              "name": "Dr. B:'It is not so much about coding and encoding but about representing external information, which can be referred to as external representation or the primary goal of coding is to understand of the external world.'"
            }
          ]
        },
        {
          "name": "Dr. M:'I think it may be a consequence of evolution and how neurons have evolved. There is an increase in cell size in many cells. And as neurons have developed into larger animals, they may well have developed into larger association areas because of evolution, but the primary biological purpose of it is presumably still to provide some local-level organization. I mean, it's really kind of two networks in one. There are cells, different cell types, that can participate in the network, and these are local circuit organizers.' B: 'So the primary purpose of an association area is to coordinate local responses for whatever reason.' M:'Yeah.' B: 'But then if you look beyond that local level of coordination—'M: 'Right.' B: '—what are the primary biological purposes of this organization that you might not immediately grasp?'"
        },
        {
          "name": "Dr. M:'I think that they would tend to become the hub of the network for sensory, intrinsic, or neuromodulatory (mixed) neurons. I think that they would also be, you know, the control centers or nodes of the network. So I see the cortex associating for the sake of communicating or coordinating activity within the network (network coordination) and also for the sake of transmitting information out from the cortex to the higher parts of the nervous system. Those higher parts, you know, communicate out to other parts of the system and to the rest of the brain. So there are these two roles that the cortex has. The first of which is simply to coordinate activity among multiple brain circuits. You know, you don't want every neuron in your brain firing in isolation. I think that would tend to be the domain of the STG or the neurons that have to communicate. And then also, you know, to, you know, send information from one circuit to another circuit.'",
          "children": [
            {
              "name": "Dr. B:'So you've just talked about what functions are supported by the neurons in these circuits, the cortical cortex. But, but when you are looking at the structure of cortical excitatory networks, what is the goal of the structure of the network? Is it to generate spikes or is it to transmit information from circuit to circuit? How are they structured? This is going to vary from circuit to circuit, for sure.'",
              "children": [
                {
                  "name": "Dr. M: 'I was going to just pick up from where we left off when we were in the, our...in the, uh, the brain. Yeah. Exactly. Yes. That's more on my, uh, you know, uh, uh, I'm going to start from the point where we left off, and I'm going to push into things I know better. It's going to be very difficult. It's going forward. Let's go backward. I'm going to ask you a question that I put to Dr.'"
                }
              ]
            }
          ]
        },
        {
          "name": "Dr. M:'To connect the neurons with each other and with the motor cortex.'",
          "children": [
            {
              "name": "Dr. B:'Oh and to produce synaptic connections between, like, different modulatory neurons and different motor neurons?'",
              "children": [
                {
                  "name": "Dr. M:'Yeah.'",
                  "children": [
                    {
                      "name": "Dr. B:'Is it fair to say that the brain can solve this problem in a matter of seconds? I mean the other problem is that it turns out to be a more complex problem, but the brain has to deal with it. So what you did is a little faster, a bit more efficient, but you made a long-term contribution to neuroscience. So the question is why the brain evolved this problem? So in short, I hope it's a simple answer.'"
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Dr. M:'I actually don't think that they're meant to be the primary purpose. I think it might be more the primary purpose is to find sensory input, so you know and to understand the inputs that the mice are receiving from the environment, how the mice were built for interacting with their local populations, and then to understand how the system was engineered to create behavior, and it sounds like this might be one of the major differences between the cortex and the cortex of a primate, so you might create behavior by having neurons that are electrically coupled to neurons that send inhibitory inputs on to them, whereas for other neurons in other species you might create the behavior by allowing the neurons to act, or allowing the neurons to express new membrane properties, so it sounds like maybe prunes are different, but with the primary purpose that I don't think that's, I think the primary purpose is the sensory area, and so I don't think so. I think that's more important.'"
        },
        {
          "name": "Dr. M:'There are many different things that those neurons do, but clearly they are important, and what is clear is to get new neurons to the association areas, because if the associated neurons become activated, that is important for the animal's performance. They do have a number of tasks, but clearly for the animal's survival, having those neurons with activation of the associated neurons is a critical requirement.'",
          "children": [
            {
              "name": "Dr. B:'So it is not important for the cells in isolation to maintain a constant activity?'",
              "children": [
                {
                  "name": "Dr. M: 'No, they are not isolated cells. They are neurons with activity in networks when their neighbors are activated. We are also interested in other functions [that] other neurons that are important for the activity of the brain, and that is why we put new neurons to the  C.T. – C.T.'",
                  "children": [
                    {
                      "name": "Dr. M:[C.T.] – [Coordinating Temporary Topical Groups] –  C.T.'",
                      "children": [
                        {
                          "name": "Dr. B:'Okay, what should be happening in the brain? The question is, \"what is the condition that is observed?\" Is there a condition that is observed, or is it a pattern that is observed? In other words, for what kind of conditions can the brain work that is, what conditions do the brains work under?'"
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Dr. M:'I guess all the muscles are used, but it is clear that the primary purpose of all the associated neurons and muscles is the production of rhythmic movements of the different muscles to allow a mouse to eat'.'",
          "children": [
            {
              "name": "Dr. B:: (laughing) Oh, so it is in agreement with another theory of what those function is for. This is a function that allows you to eat, that is, like, what do you mean eat?! To eat, you got to have muscles move, so how does it do that? But the association neurons are used to drive muscle movements. So what do they do? They drive muscle movements. I think that is a critical function. It is clear you see these kinds of connections between neurons, which we know occur in all animals all the time. We know that all neurons are electrically coupled. We know that these neurons influence and/or are influenced by all other kinds of neurons in the system.'"
            },
            {
              "name": "Dr. B:'So that is its primary purpose. You would want to know what the consequence of this rhythmic movement would be if that particular function is compromised.'",
              "children": [
                {
                  "name": "Dr. M: 'That is simple enough. What we would expect is that the muscle coordination will be deteriorated, and the movements will be incoherent. But you know, it's difficult to actually say what the consequences of an alteration on brain operation will be because so many experiments depend on this kind of in vitro preparations. How many experiments you are willing to undertake that would depend solely on these conditions without involving the brain. There is no reason to believe that your answers would be applicable to the brain in its  in vivo  state. So as far as we can evaluate the consequences... it's more efficient to go in and look at what happens in the brain when the primary function takes place. So that's what the first thing we do. I would assume that this is the default operation in the brain.'"
                }
              ]
            }
          ]
        },
        {
          "name": "Dr. M:'I don't think people have a real concept of the purpose. In other words, what's their fundamental biological output?'"
        },
        {
          "name": "Dr. M:'Well,  I 'think' they're mostly there for neural integration, the same as neurons are.'",
          "children": [
            {
              "name": "Dr. B:'I don't know if they're necessary or not.'",
              "children": [
                {
                  "name": "Dr. M:\"Well, it seems to be for neural integration, not just for the functions, the functions they're there to perform. I don't know if that was obvious when you were studying this, whether or not they're necessary, that they're there to integrate neural networks. So they're mainly there to combine neurons, yeah.'"
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}