{
  "name": "The following is a transcript of a conversation between the two famous neuroscientists Dr. Buzsaki and Dr. Marder. Dr. Buzsaki's primary interests is 'neural syntax', i.e., how segmentation of neural information is organized by the numerous brain rhythms to support cognitive functions. Dr. Marder studies the dynamics of small neuronal networks, and her work was instrumental in demonstrating that neuronal circuits are not 'hard-wired' but can be reconfigured by neuromodulatory neurons and substances to produce a variety of outputs. The two are having a public academic panel discussion about the function of the higher-order-cortex.\n-BEGIN TRANSCRIPT-\n",
  "g_rating": 0.8,
  "s_rating": 0.9999998807907104,
  "t_rating": 1.280624754399756,
  "r_rating": 1.1552514260790236,
  "children": [
    {
      "name": "Dr. B: 'Do you have any ideas about how neuromodulators might affect the formation and function of dendritic spines?'",
      "g_rating": 0.6,
      "s_rating": 0.49703702330589294,
      "t_rating": 0.7791314411168264,
      "r_rating": 0.818703618126625,
      "children": [
        {
          "name": "Dr. M:'I think if you were asking me about neuromodulators and their effects on a dendritic tree, the answer would be very interesting. But the dendritic tree of a dendritic neuron is already a fascinating place, so that's where I would start.'",
          "g_rating": 0.8,
          "s_rating": 0.48862719535827637,
          "t_rating": 0.9374201491560202,
          "r_rating": 0.9379133358230438,
          "children": [
            {
              "name": "Dr. B:'What would be a fun question would be to ask them how they might affect the formation of dendritic arbors, and their connectivity to each other. So what I'm asking is: What are the main types of dendritic tree patterns that can be achieved? And what are the functions that these patterns might perform? So, you're looking in the brain for ways to move from patterns to functions.'",
              "g_rating": 0.8,
              "s_rating": 0.49240127205848694,
              "t_rating": 0.9393928958241148,
              "r_rating": 0.9393928958241148
            }
          ]
        }
      ]
    }
  ]
}