{
  "name": "The following is a transcript of a conversation between the two famous neuroscientists Dr. Buzsaki and Dr. Marder. Dr. Buzsaki's primary interests is 'neural syntax', i.e., how segmentation of neural information is organized by the numerous brain rhythms to support cognitive functions. Dr. Marder studies the dynamics of small neuronal networks, and her work was instrumental in demonstrating that neuronal circuits are not 'hard-wired' but can be reconfigured by neuromodulatory neurons and substances to produce a variety of outputs. The two are having a public academic panel discussion about the function of the higher-order-cortex.\n-BEGIN TRANSCRIPT-\n",
  "children": [
    {
      "name": "Dr. B: 'What do you think is the primary purpose of the association areas in the mouse cortex?'",
      "children": [
        {
          "name": "Dr. M:'It was actually thought that they were just providing information for the pyloric circuits, not providing support for higher-order behavior and whatnot. But you actually see, during aging, when the mice lose their capacity for rhythmic behavior, when one of the neurons goes down for a long period of time, when you activate it again, it produces rhythmic behavior, that it provides some sort of an additional drive that the neurons can use. So, it is actually believed that the higher cortical centers are in a cycle, they are part and parcel of the larger process of generating rhythmic behavior, as all the network dynamics that produce rhythmic behavior are themselves regulated rhythmically.'",
          "children": [
            {
              "name": "Dr. B:- 'It is also known that the pyloric and gastric mill rhythm are also regulated, rhythmically, by other modulators?'",
              "children": [
                {
                  "name": "Dr. M:- 'Yeah, there are multiple modulators that feed into the oscillations, but there are also multiple rhythmic processes in the brain.'",
                  "children": [
                    {
                      "name": "Dr. B:'Do you also think that the higher order cortex, or the association areas, does not really give rise to behavior?'",
                      "children": [
                        {
                          "name": "Dr. M:'Well this is a complicated issue because we actually thought for a long time that the association areas were an extension of the higher central cortex, and they were kind of the last outpost, if you will, when neurons started leaving for the periphery. But the truth is, we now know that there has to be a very strong interaction between neurons, or at least two neurons, because if you separate these two nerves by one, when you activate one of those nerves you create what's called a \"double spike\", the other neuron will become, if you will inhibit one of those nerves, not go and continue its way, but start producing at least a ton of action potentials, whereas these muscles will become activated.'",
                          "children": [
                            {
                              "name": "Dr. M: 'So, this shows you that even though the association areas are separate, they have to coordinate themselves to be able to move appropriately.'  (1.'",
                              "children": [
                                {
                                  "name": "Dr. B:[0.'",
                                  "children": [
                                    {
                                      "name": "Dr. M:'It has to, that's right.'"
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "Dr. B:'So the two things, this is a big problem with these studies, is that the relationship between behavior and activity of these very large association areas, it's often difficult to distinguish between behavior and activity. It's possible that, if you put a large number of electrodes in the brain without knowing what brain responses you're expecting, you might find the brains activity resembles, if anything, the patterns of the motor cortex or the somatosensory cortex, where the motor cortex, for example, it doesn't produce the motor behavior but it's perfectly able to predict that behavior of the output muscles, and the somatosensic cortex doesn't produce the somatosensa behavior but perfectly able to predict the outcome of motor cortex activity. For example, it will be able to generate output motor pattern. So we have to be careful. We have to make sure that we actually have in our possession a brain response that actually does what it is supposed to do.'",
                              "children": [
                                {
                                  "name": "Dr. M:'And that is very easy, but it becomes even more complicated, because because you have to be sure about what you're recording. For example, when you're recording from the motor cortex, you have to actually, you have to be absolutely sure that you're recording a brain neuron that is a motor neuron, something that makes muscles contract, because you cannot tell whether a brain neuron is a motor neuron unless you've identified it. It's really a very difficult problem because there are so many ways to identify neurons from the brain if they are not motor neurons. They can be identified and sorted so completely that you can be absolutely sure that it will react to the modulators that you're looking for. In terms of whether or not the higher order cortex is doing these things and regulating them so I'm not, I don't know that these data will help you prove that you're dealing with a single population or a multiple population.'"
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Dr. M:'In fact, all of the modulatory inputs into the central pattern generating networks. They all work rhythmically. For example, the gastric mill rhythm is regulated by peptides. There are also known neurotransmitters, known hormones, that influence this network, that work rhythmically, and are rhythmically regulated themselves. So, it looks like the neurons in the central pattern generating network are also rhythmically regulated themselves by other neuromodulators as well.'"
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}